In [12]:
import pandas as p

p.read_excel(r"C:\Users\rober\Desktop\Data science course\Data lesson 1.xlsx")

    Name      Batch  RollNo  Adress  Phone No.        Email
0   Gicu   pythin01       1    Ia;i       7412   gicu_pyton
1  Cretu    java002      23  vaslui        723   cretu_java
2   bibi  python045     234    cluj       7422  bibi_python

In [11]:
p.read_csv(r"C:\Users\rober\Desktop\Data science course\Data lesson 2.csv")

    Name       Batch  RollNo   Adress  Phone No.        Email
0   Gicu    pythin01       1     Ia;i       7412   gicu_pyton
1  Cretu     java002      23   vaslui        723   cretu_java
2   bibi   python045     234     cluj       7422  bibi_python
3   gigi     java004    2342   vaslui      98283        gigi_
4   nicu  python0234   74123  belesti       9422        nicu_

In [20]:
p.read_csv(r"C:\Users\rober\Desktop\Data science course\Data lesson 3.tsv",sep='\t')

           Name  PhoneNumber BatchNumber
Allen  824927492               pythin-09
bob    232352452               python-06
agela   20324234               python-02